In [5]:
import pandas as pd
import sqlite3

In [6]:
db=sqlite3.connect("hubway.db")

In [7]:
def run_query(query):
    return pd.read_sql_query(query,db)

In [12]:
#selects all the columns from the trips table. * is a wild card indicating we want all the 
#columns. Limit 5 means we only want 5 rows.
query="SELECT * FROM trips LIMIT 5;"

In [13]:
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,1,9,2011-07-28 10:12:00,23,2011-07-28 10:12:00,23,B00468,Registered,'97217,1976.0,Male
1,2,220,2011-07-28 10:21:00,23,2011-07-28 10:25:00,23,B00554,Registered,'02215,1966.0,Male
2,3,56,2011-07-28 10:33:00,23,2011-07-28 10:34:00,23,B00456,Registered,'02108,1943.0,Male
3,4,64,2011-07-28 10:35:00,23,2011-07-28 10:36:00,23,B00554,Registered,'02116,1981.0,Female
4,5,12,2011-07-28 10:37:00,23,2011-07-28 10:37:00,23,B00554,Registered,'97214,1983.0,Female

In [16]:
#Suppose we want to see specific columns we do

query="SELECT duration, start_date FROM trips LIMIT 5;"

In [17]:
run_query(query)

   duration           start_date
0         9  2011-07-28 10:12:00
1       220  2011-07-28 10:21:00
2        56  2011-07-28 10:33:00
3        64  2011-07-28 10:35:00
4        12  2011-07-28 10:37:00

In [19]:
#ORDER BY.

query='''
SELECT duration
FROM trips
ORDER BY duration DESC
LIMIT 5;
'''

run_query(query)

   duration
0      9999
1      9998
2      9998
3      9997
4      9996

In [20]:
#WHERE .

#This command helps you look into a particlular slice of your data

#Lets query the db using WHERE such that it returns data from the trip table
#of all bike rides greater than 9990 seconds

query='''
SELECT *
FROM trips
WHERE duration > 9990;
'''

run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,4768,9994,2011-08-03 17:16:00,22,2011-08-03 20:03:00,24,B00002,Casual,,,
1,8448,9991,2011-08-06 13:02:00,52,2011-08-06 15:48:00,24,B00174,Casual,,,
2,11341,9998,2011-08-09 10:42:00,40,2011-08-09 13:29:00,42,B00513,Casual,,,
3,24455,9995,2011-08-20 12:20:00,52,2011-08-20 15:07:00,17,B00552,Casual,,,
4,55771,9994,2011-09-14 15:44:00,40,2011-09-14 18:30:00,40,B00139,Casual,,,
5,81191,9993,2011-10-03 11:30:00,22,2011-10-03 14:16:00,36,B00474,Casual,,,
6,89335,9997,2011-10-09 02:30:00,60,2011-10-09 05:17:00,45,B00047,Casual,,,
7,124500,9992,2011-11-09 09:08:00,22,2011-11-09 11:55:00,40,B00387,Casual,,,
8,133967,9996,2011-11-19 13:48:00,4,2011-11-19 16:35:00,58,B00238,Casual,,,
9,147451,9996,2012-03-23 14:48:00,35,2012-03-23 17:35:00,33,B00550,Casual,,,
10,315737,9995,2012-07-03 18:28:00,12,2012-07-03 21:15:00,12,B00250,Registered,'02120,1964,Male
11,319597,9994,2012-07-05 11:49:00,52,2012-07-05 14:35:00,55,B00237,Casual,,,
12,416523,9998,2012-08-15 12:11:00,54,2012-08-15 14:58:00,80,B00188,Casual,,,
13,541247,9999,2012-09-26 18:34:00,54,2012-09-26 21:21:00,54,T01078,Casual,,,

In [25]:
#More complex logical queries can be peformed  using the WHERE function
#All you need is the AND and OR logic

query='''
SELECT *
FROM trips
WHERE (duration >=9990) AND (sub_type="Registered")
ORDER BY duration DESC;
'''

In [26]:
run_query(query)

,id,duration,start_date,start_station,end_date,end_station,bike_number,sub_type,zip_code,birth_date,gender
0,315737,9995,2012-07-03 18:28:00,12,2012-07-03 21:15:00,12,B00250,Registered,'02120,1964.0,Male

In [ ]:
#Now we want to find out how many trips were undertaken by registered
#users/customers

In [27]:
query='''
SELECT COUNT (*)
FROM trips 
WHERE (sub_type="Registered");
'''

run_query(query)

   COUNT (*)
0    1105192

In [29]:
#The column header is not very descriptive. Let's change iit

query='''
SELECT COUNT (*) AS "Total Trips By Registered Users"
FROM trips
WHERE (sub_type="Registered");
'''

run_query(query)

   Total Trips By Registered Users
0                          1105192

In [31]:
#Aggregate functions

#We can use aggregating functions such as SUM, AVG (average), MIN, MAX
#etc

query='''
SELECT AVG (duration) AS "Average Duration"
FROM trips;

'''

run_query(query)

   Average Duration
0        912.409682

In [32]:
#This is about 15mins.
#This makes some sense since Hubway charges extra fees for trips over
#30mins. The service is meant for riders to take short,one-way trips

query='''
SELECT sub_type, AVG (duration) AS "Average Duration"
FROM trips
GROUP BY  sub_type;
'''

run_query(query)

     sub_type  Average Duration
0      Casual       1519.643897
1  Registered        657.026067

In [ ]:
#Wow!  Causual users take more trips. It could be that causual riders
#are tourists who spend more time on the bikes to ensure they get
#around to see more places and the registered ones are those who 
#actullay live and work in the city. I imagine the registered ones are
#those seldom use it for pleasure, probably just taking trips to and 
#fro from work

In [38]:
# Lets figure out which bike was used for the most trips.

query='''

SELECT bike_number AS "Bike Number", COUNT(*) AS "Number of Trips"
FROM trips
GROUP BY bike_number
ORDER BY COUNT (*) DESC
LIMIT 2;

'''

run_query(query)

  Bike Number  Number of Trips
0      B00490             2120
1      B00268             2104

In [44]:
#Lets figure out the duration of registered members over the age of 
#30. To achieve this, we will use the average arithemtic operator.


query='''
SELECT AVG (duration)
FROM trips
WHERE (2017-birth_date)>30;
'''

run_query(query)

   AVG (duration)
0      923.014685

In [ ]:
#running the same query for age less than 30, you will see that the
#output is less than  the above. Suggesting that more people over 30
#use the bicycle service more. This is Probably because those over 30 
#are more health concious. Remember that cycling is a form of excerise

In [45]:
#Let's take a peek at the columns in the station table

query='''

SELECT *
FROM stations
LIMIT 5;
'''

run_query(query)

,id,station,municipality,lat,lng
0,3,Colleges of the Fenway,Boston,42.340021,-71.100812
1,4,Tremont St. at Berkeley St.,Boston,42.345392,-71.069616
2,5,Northeastern U / North Parking Lot,Boston,42.341814,-71.090179
3,6,Cambridge St. at Joy St.,Boston,42.361284999999995,-71.06514
4,7,Fan Pier,Boston,42.353412,-71.044624

In [46]:
#The columns are self explanatory. Station ID, station name, latitude
#and longitudes of stations. 

#Let me point out here that the Station ID corresponds to the 
#start_station and end_station in the trips table

In [53]:
#Lets figure out which stations is the most frequent starting point.
#The JOIN and ON commands will be used. 

#You can read more about JOIN online


query='''

SELECT stations.station AS "Station", COUNT (*) AS "Count"
FROM trips
JOIN stations

ON trips.start_station=stations.id
GROUP BY stations.station
ORDER BY COUNT(*) DESC
LIMIT 5;
'''


run_query(query)

                                         Station  Count
0              South Station - 700 Atlantic Ave.  56123
1       Boston Public Library - 700 Boylston St.  41994
2  Charles Circle - Charles St. at Cambridge St.  35984
3                           Beacon St / Mass Ave  35275
4                   MIT at Mass Ave / Amherst St  33644

In [54]:
#A quick google search reveals that these are very popular areas in
#Boston because of the scenery. No wonder it has a high ridership

In [56]:
#Let's answer the question: which stations are frequently used for
#round trips.  We will proceed as above, however, we will add a WHERE
#clause to restrict our COUNT to trips where the start_station is the
#same as the end_station

query='''

SELECT stations.station AS "Station", COUNT (*) AS "Count"
FROM trips
JOIN stations
ON trips.start_station=stations.id 
WHERE trips.start_station=trips.end_station
GROUP BY stations.station
ORDER BY COUNT(*) DESC
LIMIT 5;
'''

run_query(query)

                                         Station  Count
0    The Esplanade - Beacon St. at Arlington St.   3064
1  Charles Circle - Charles St. at Cambridge St.   2739
2       Boston Public Library - 700 Boylston St.   2548
3                  Boylston St. at Arlington St.   2163
4                           Beacon St / Mass Ave   2144

In [57]:
# It is interesting to see that a number of these stations are the 
#same as the previous question

In [ ]:
#Another question we can answer is: How many trips start and end in 
#different municipalities?

In [59]:
query='''

SELECT COUNT(trips.id) AS "Total Trips Ending in Different Municipalities"

FROM trips

JOIN stations AS start
ON trips.start_station=start.id
JOIN stations AS end
ON trips.end_station=end.id
WHERE start.municipality <> end.municipality;

'''

run_query(query)

   Total Trips Ending in Different Municipalities
0                                          309748

In [ ]:
# This shows that about 300K out of 1.5million trips equivalent to 20%
#ended in a different municipality. This points to the fact that  most
#customers use it for short distances

In [60]:

# we can also answer questions like

#1. How many trips incurred additional fees

#2. Which bike was used for the longest total time?

#3. Did registered or casual users take more round trips?

#4. Which municipality had the longest average duration?